## Target_Guided_Ordinal_Encoding

In [2]:
import pandas as pd

In [5]:
# crating a simle dataFrame with a categorical variable and a target variable.
df=pd.DataFrame({
    'City': ['New_york', 'London','Paris','Tokyo','New_york','Paris'],
    'price': [200,150,300,250,100,320]
})

In [9]:
df

       City  price
0  New_york    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New_york    100
5     Paris    320

In [8]:
# calculate the mean price for each city.
df.groupby('City')['price'].mean()

City
London      150.0
New_york    150.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [11]:
mean_price=df.groupby('City')['price'].mean().to_dict()

In [12]:
mean_price

{'London': 150.0, 'New_york': 150.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [13]:
# repalce each city with its mean price.

In [15]:
df['city_encoded']=df['City'].map(mean_price)

In [16]:
df

       City  price  city_encoded
0  New_york    200         150.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New_york    100         150.0
5     Paris    320         310.0